/* No comment provided by engineer. */
"Cancel" = "Cancel";

/* No comment provided by engineer. */
"Launch Twitter..." = "Launch Twitter...";

/* No comment provided by engineer. */
"Please wait" = "Please wait";

/* No comment provided by engineer. */
"Save Panorama" = "Save Panorama";

/* No comment provided by engineer. */
"Saving..." = "Saving...";

/* No comment provided by engineer. */
"Twitter" = "Twitter";

/* No comment provided by engineer. */
"Browsing the website(%@) by #MtSurfing" = "Browsing the website(%@) by #MtSurfing";

/* No comment provided by engineer. */
"http://tinyurl.com/mtsurfing" = "http://tinyurl.com/mtsurfing";

/* No comment provided by engineer. */
"Cannot Open Page" = "Cannot Open Page";

/* No comment provided by engineer. */
"Mt.Surfing Cannot open the page because the server cannot be found." = "Mt.Surfing Cannot open the page because the server cannot be found.";

"Connection Cancelled" = "Connection Cancelled";
"Mt.Surfing Cannot complete loading because the connection is cancelled." = "Mt.Surfing Cannot complete loading because the connection is cancelled.";

/* No comment provided by engineer. */
"Search Keyword or URL" = "Search Keyword or URL";


